CRUD/app/Controllers/Home.php

SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 3, 3
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index(): string
    {
        $data['users'] = $this->user->orderby('id','DESC')->paginate(3,'group1');

INSERT INTO `users` (`username`, `email`) VALUES ('admin', 'adddd@gmail.com')
---
    public function saveUser()
    {
        $username = $this->request->getPost('username');
        $email = $this->request->getPost('email');

        $this->user->insert([
            'username' => $username,
            'email' => $email
        ]);